---
kind: other
id: Methods.T:Autodesk.Revit.DB.PlanCircuit
source: html/8575fc1d-b966-e48a-810d-32f13bbed31c.htm
---
# PlanCircuit Methods

Causes the object to release immediately any resources it may be utilizing.